import streamlit as st
import pandas as pd
import numpy as np

# 餐厅数据
restaurants_data = {
    "餐厅": ["兰州拉面", "螺蛳粉", "肯德基", "小汤总", "华莱士","朴大叔"],
    "类型": ["西北风味面食", "中式快餐", "西式快餐", "中餐", "西式快餐","韩式快餐"],
    "评分": [4.6, 4.2, 4.7, 4.3, 4.1,4.4],
    "人均消费(元)": [15, 12,50, 22, 16,18],
   
}
# 创建餐厅数据框
df = pd.DataFrame(restaurants_data)

# 创建地图坐标数据
map_data={
         "latitude": [22.854301, 22.864321, 22.814321, 22.834321, 22.873774],
         "longitude": [108.222763, 108.322742, 108.262742, 108.212742, 108.302431]
}
# 创建地图坐标数据框
map_df=pd.DataFrame(map_data)
#显示地图
st.map(map_df)

#分割线
st.markdown('***')
st.header("餐厅数据")
# 使用write()方法展示数据框
st.write(df)

#分割线
st.markdown('***')
#标题
st.title("🌟餐厅评分")
# 修改df，用餐厅列作为df的索引，替换原有的索引
df.set_index('餐厅', inplace=True)
# 通过y指定评分所在这一列为条形图的y轴
st.bar_chart(df, y='评分')

st.markdown('***')
st.title("💰餐厅人均消费")
# 修改df，用类型列作为df的索引，替换原有的索引
df.set_index('类型', inplace=True)
# 通过y指定人均消费(元)所在这一列为折线图的y轴，并通过width、height和use_container_width指定折线图的宽度和高度
st.line_chart(df, y='人均消费(元)',width=800, height=500, use_container_width=False)

#分割线
st.markdown('***')
#标题
st.title("📈餐厅一年价格趋势")
# 价格走势数据
price_data={
        '月份':["01月", "02月", "03月", "04月", "05月","06月","07月", "08月", "09月", "10月", "11月","12月"],
        '兰州拉面':[10,15,12,13,20,11,14,16,18,10,11,16],
        '螺蛳粉':[11,10,15,19,13,14,10,10,16,17,11,12],
        '肯德基':[23,25,19,50,78,29,25,40,30,20,26,32],
        '小汤总':[19,16,18,15,20,26,28,46,75,23,34,30],
        '华莱士':[10,21,11,15,15,13,46,75,16,42,65,13],
        '朴大叔':[8,14,10,16,23,19,18,10,22,23,10,19],
}
# 创建价格走势数据框
df1 = pd.DataFrame(price_data)
# 通过x指定月份所在这一列为折线图的x轴，并通过width、height和use_container_width指定折线图的宽度和高度
st.line_chart(df1, x='月份',width=800, height=500, use_container_width=False)

#分割线
st.markdown('***')
# 时间人流量数据
time_data={
        '时间':["10:00", "11:00", "12:00", "13:00", "16:00","17:00","18:00", "19:00", "20:00"],
        '兰州拉面':[3,5,10,20,6,15,22,12,7],
        '螺蛳粉':[4,3,8,17,8,15,45,16,8],
        '肯德基':[15,13,78,98,16,13,13,26,16],
        '小汤总':[13,32,21,13,19,19,13,21,24],
        '华莱士':[16,64,32,21,16,5,7,9,9],
        '朴大叔':[44,21,35,18,9,18,16,11,17],
}
st.title("🕐用餐高峰期")
# 创建人流量数据框
df2= pd.DataFrame(time_data)
# 通过x指定时间所在这一列为面积图的x轴，并通过width、height和use_container_width指定面积图的宽度和高度
st.area_chart(df2, x='时间',width=800, height=500, use_container_width=False)



